//Дано натуральне число N. Над ним можна провести наступний набір операцій:
//
//віднімати одиницю;
//ділити втричі, якщо число кратно трьом;
//ділити на два, якщо число парне.
//Після виконання однієї з операцій до одержання 1 Вивести найменшу кількість операцій. 10 -3, 5 - 3, 1 - 0, 999 - 8
#include<iostream>
#include<vector>

using namespace std;

int main(){

    int n;
    cin>>n;
    vector <int> val(n+1, n);
    val[1] = 0;
    for(int i=1; i<n; i++){
        if((i+1) <= n && (val[i]+1) < val[i+1]) { val[i+1] = val[i] + 1;}
        if((i*2) <=n && (val[i] + 1) < val[i*2]) { val[i*2] = val[i] + 1; }
        if((i*3) <= n && (val[i] + 1) < val[i*3]) { val[i*3]= val[i] +1; }
    }
    cout<<val[n];
    return 0;
}
